НВ_Доработки/Catalogs/НВД_Периоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НВД_Периоды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

НВ_Доработки/Catalogs/НВД_Периоды/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Процедура - обработчик события объекта "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		Возврат; // отказ
	ИначеЕсли НЕ ЗначениеЗаполнено(Периодичность) Тогда
		Возврат; // отказ
	КонецЕсли;
	
	Если Периодичность = Перечисления.Периодичность.Год Тогда
		НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,    НачалоГода(ДатаНачала));
		Справочники.НВД_Периоды.ОпределитьДатуОкончания(ДатаНачала, ДатаОкончания, Периодичность);
		НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания)));
		
	//ИначеЕсли Периодичность = Перечисления.Периодичность.ДевятьМесяцев Тогда
	//	НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,   НачалоГода(ДатаНачала));
	//	НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, "Девять месяцев " + Формат(ДатаНачала, "ДФ='гггг ""г.""'"));
	//	Справочники.Периоды.ОпределитьДатуОкончания(ДатаНачала, ДатаОкончания, Периодичность);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
		Если ДатаНачала < ДобавитьМесяц(НачалоГода(ДатаНачала), 6) Тогда
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала, НачалоГода(ДатаНачала));
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, "1 полугодие " + Формат(ДатаНачала, "ДФ='гггг ""г.""'"));
		Иначе 
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала, ДобавитьМесяц(НачалоГода(ДатаНачала), 6));
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, "2 полугодие " + Формат(ДатаНачала, "ДФ='гггг ""г.""'"));
		КонецЕсли;
		Справочники.НВД_Периоды.ОпределитьДатуОкончания(ДатаНачала, ДатаОкончания, Периодичность);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,    НачалоКвартала(ДатаНачала));
		Справочники.НВД_Периоды.ОпределитьДатуОкончания(ДатаНачала, ДатаОкончания, Периодичность);
		НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания)));
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,    НачалоМесяца(ДатаНачала));
		Справочники.НВД_Периоды.ОпределитьДатуОкончания(ДатаНачала, ДатаОкончания, Периодичность);
		НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания)));
	ИначеЕсли Периодичность = Перечисления.Периодичность.Декада Тогда
		
		Если День(ДатаНачала) < 10 Тогда
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,    НачалоМесяца(ДатаНачала));
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, "1 декада. " + Формат(ДатаНачала, "ДФ='ММММ гггг ""г.""'"));
		ИначеЕсли День(ДатаНачала) < 20 Тогда
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,    ОбщегоНазначения.ДобавитьДень(НачалоМесяца(ДатаНачала), 10));
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, "2 декада. " + Формат(ДатаНачала, "ДФ='ММММ гггг ""г.""'"));
		Иначе 
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,    ОбщегоНазначения.ДобавитьДень(НачалоМесяца(ДатаНачала), 20));
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, "3 декада. " + Формат(ДатаНачала, "ДФ='ММММ гггг ""г.""'"));
		КонецЕсли;
		Справочники.НВД_Периоды.ОпределитьДатуОкончания(ДатаНачала, ДатаОкончания, Периодичность);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		
		Если День(ДатаНачала) < 7 Тогда
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,    ?(День(НачалоНедели(ДатаНачала))>День(ДатаНачала),НачалоМесяца(ДатаНачала),НачалоНедели(ДатаНачала)));
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, ?(ОбщегоНазначения.НачалоНеделиПоМесяцу(ДатаНачала)=НачалоМесяца(ДатаНачала),"1 неделя. ","2 неделя. ") + Формат(ДатаНачала, "ДФ='ММММ гггг ""г.""'"));
		ИначеЕсли День(ДатаНачала) < 14 Тогда
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,    НачалоНедели(ДатаНачала));
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, ?(ОбщегоНазначения.НачалоНеделиПоМесяцу(ОбщегоНазначения.ДобавитьИнтервал(ДатаНачала,Перечисления.Периодичность.Неделя,-1))=НачалоМесяца(ДатаНачала),"2 неделя. ","3 неделя. ") + Формат(ДатаНачала, "ДФ='ММММ гггг ""г.""'"));
		ИначеЕсли День(ДатаНачала) < 21 Тогда
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,    НачалоНедели(ДатаНачала));
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, ?(ОбщегоНазначения.НачалоНеделиПоМесяцу(ОбщегоНазначения.ДобавитьИнтервал(ДатаНачала,Перечисления.Периодичность.Неделя,-2))=НачалоМесяца(ДатаНачала),"3 неделя. ","4 неделя. ") + Формат(ДатаНачала, "ДФ='ММММ гггг ""г.""'"));
		Иначе 
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(ДатаНачала,    НачалоНедели(ДатаНачала));
			НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, ?(ОбщегоНазначения.НачалоНеделиПоМесяцу(ОбщегоНазначения.ДобавитьИнтервал(ДатаНачала,Перечисления.Периодичность.Неделя,-3))=НачалоМесяца(ДатаНачала),"4 неделя. ","5 неделя. ") + Формат(ДатаНачала, "ДФ='ММММ гггг ""г.""'"));
		КонецЕсли;
		Справочники.НВД_Периоды.ОпределитьДатуОкончания(ДатаНачала, ДатаОкончания, Периодичность);
	
	Иначе
		Справочники.НВД_Периоды.ОпределитьДатуОкончания(ДатаНачала, ДатаОкончания, Периодичность);
		НВД_ОбщегоНазначения.УстановитьНовоеЗначение(Наименование, ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания)));
	КонецЕсли;
	
	
КонецПроцедуры

// Процедура - обработчик события объекта "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Произвольный Тогда
		Заполнить(Неопределено);
	КонецЕсли; 
	                
	ШапкаОшибки = "Период """ + ЭтотОбъект + """ не может быть записан:";
	
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		НВД_ОбщегоНазначения.СообщитьОбОшибке("- Периодичность не задана!", Отказ, ШапкаОшибки); 
	КонецЕсли;
	
	Если ДатаНачала = '00010101' Тогда
		НВД_ОбщегоНазначения.СообщитьОбОшибке("- Не заполнен реквизит ""Дата начала""!", Отказ, ШапкаОшибки); 
	КонецЕсли;
	
	Если ДатаОкончания = '00010101' Тогда
		НВД_ОбщегоНазначения.СообщитьОбОшибке("- Не заполнен реквизит ""Дата окончания""!", Отказ, ШапкаОшибки); 
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Периоды.Ссылка,
	|	РАЗНОСТЬДАТ(Периоды.ДатаНачала, Периоды.ДатаОкончания, ДЕНЬ) КАК РазностьДат
	|ИЗ
	|	Справочник.НВД_Периоды КАК Периоды
	|ГДЕ
	|	(НЕ Периоды.Произвольный)
	|	И (Периоды.ДатаНачала <= &ДатаНачала
	|				И Периоды.ДатаОкончания > &ДатаОкончания
	|			ИЛИ Периоды.ДатаНачала < &ДатаНачала
	|				И Периоды.ДатаОкончания >= &ДатаОкончания)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазностьДат";
	
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда // Есть вышестоящий период
		
		Родитель=Результат.Ссылка;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) и (ДатаНачала < Родитель.ДатаНачала или ДатаОкончания > Родитель.ДатаОкончания) Тогда
		НВД_ОбщегоНазначения.СообщитьОбОшибке("- интервал """ + Наименование + """ выходит за пределы интервала - родителя """ + Родитель + """!", Отказ, ШапкаОшибки); 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Периоды.Ссылка КАК Ссылка,
	|	Периоды.ДатаНачала,
	|	Периоды.ДатаОкончания
	|ИЗ
	|	Справочник.НВД_Периоды КАК Периоды
	|ГДЕ
	|	Периоды.Ссылка <> &Ссылка
	|	И Периоды.Периодичность = &Периодичность
	|	И (Периоды.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			ИЛИ Периоды.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания)";
	Запрос.УстановитьПараметр("Ссылка",        Ссылка);
	Запрос.УстановитьПараметр("Периодичность", Периодичность);
	Запрос.УстановитьПараметр("ДатаНачала",    ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НВД_ОбщегоНазначения.СообщитьОбОшибке("- интервал """ + Наименование + """ пересекается с существующим периодом """ + Выборка.Ссылка + """!", Отказ, ШапкаОшибки); 
	КонецЦикла;
			
КонецПроцедуры

// Процедура - обработчик события объекта "ПриЗаписи".
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ШапкаОшибки = "Период """ + ЭтотОбъект + """ не может быть записан:";
	
    Запрос = Новый Запрос(
    "ВЫБРАТЬ
    |	Периоды.Ссылка
    |ИЗ
    |	Справочник.НВД_Периоды КАК Периоды
    |ГДЕ
    |	Периоды.Родитель = &Родитель"
    );
    Запрос.УстановитьПараметр("Родитель", Ссылка);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Пока Выборка.Следующий() Цикл
        
        ВыборкаСсылка = Выборка.Ссылка;
        
        Объект = ВыборкаСсылка.ПолучитьОбъект();
        
        Объект.Произвольный = Произвольный;
       
        Если Объект.Произвольный = ВыборкаСсылка.Произвольный Тогда
        	Продолжить;
        КонецЕсли;
        
        Попытка
            Объект.Записать();
        Исключение
            НВД_ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(), Отказ, ШапкаОшибки);
            Возврат;
        КонецПопытки; 
        
    КонецЦикла;
	
КонецПроцедуры
